asd74588/test1/MDK-ARM/.pack/Keil/STM32L4xx_DFP.1.4.0/SVD/STM32L4x1_v1r1.svd
              &#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#185;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#226;&#8364;&#339;user&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#190;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALOUT</name>
              <description>Operational amplifier calibration
              output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA_RANGE</name>
              <description>Operational amplifier power supply range
              for stability</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP1_OTR</name>
          <displayName>OPAMP1_OTR</displayName>
          <description>OPAMP1 offset trimming register in normal
          mode</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIMOFFSETN</name>
              <description>Trim for NMOS differential
              pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIMOFFSETP</name>
              <description>Trim for PMOS differential
              pairs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP1_LPOTR</name>
          <displayName>OPAMP1_LPOTR</displayName>
          <description>OPAMP1 offset trimming register in low-power
          mode</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIMLPOFFSETN</name>
              <description>Trim for NMOS differential
              pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIMLPOFFSETP</name>
              <description>Trim for PMOS differential
              pairs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
